app/views/books/_index.html.erb

					<%= link_to book_favorites_path(book,redirect_id: 0), method: :delete do %>
					<span class="glyphicon glyphicon-heart"><%= book.favorites.count %></span>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

					<span class="glyphicon glyphicon-heart-empty">
					<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

			<td>
				コメント数：<%= @book.book_comments.count %>
---
SELECT "books".* FROM "books"