app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
							<%= link_to book_favorites_path(@bookdetail,redirect_id: 0),method: :delete do %>
							<span class="glyphicon glyphicon-heart"><%= @bookdetail.favorites.count %></span>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]
---
							<%= link_to book_favorites_path(@bookdetail,redirect_id: 0),method: :post do %>
							<span class="glyphicon glyphicon-heart-empty"><%= @bookdetail.favorites.count %></span>

SELECT "book_comments".* FROM "book_comments"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]
---
						<td>
							コメント数：<%= @bookdetail.book_comments.count %>