app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("user_id", "book_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["book_id", 1], ["comment", "テスト"], ["created_at", "2020-03-10 09:23:17.014544"], ["updated_at", "2020-03-10 09:23:17.014544"]]
---
	def create
		@book = Book.find(params[:book_id])
		@book_new =Book.new
		@book_comment = @book.book_comments.new(book_comment_params)
		@book_comment.user_id = current_user.id
		# @book_comment = Book_comment.new(book_comment_params)
		# @book_comment.book_id = @book.id
		if @book_comment.save

SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 2]]
---
	def destroy
		@book_comment = BookComment.find(params[:book_id])
		if @book_comment.user != current_user
			redirect_ to request.referer
		end
		@book_comment.destroy

SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@book_comment = BookComment.find(params[:book_id])

SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "book_comments" SET "comment" = ?, "updated_at" = ? WHERE "book_comments"."id" = ?  [["comment", "編集しました"], ["updated_at", "2020-03-10 10:35:50.197396"], ["id", 1]]
---
	def update
		@book_comment = BookComment.find(params[:book_id])
		@book_comment.update(book_comment_params)