app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
  	@bookdetail = Book.find(params[:id])
    @user = User.find(@bookdetail.user_id)

SELECT "books".* FROM "books"
---
  def index
  	@books = Book.all #一覧表示するためにBookモデルの情報を全てくださいのall

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "テスト2"], ["body", "aaa"], ["user_id", 2], ["created_at", "2020-03-10 08:08:05.315796"], ["updated_at", "2020-03-10 08:08:05.315796"]]
SELECT "books".* FROM "books"
---
  def create
  	@book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
    @book.user_id = current_user.id
  	if @book.save #入力されたデータをdbに保存する。
  		redirect_to @book, notice: "successfully created book!"#保存された場合の移動先を指定。
  	else
      flash[:notice] = "Error !!"
  		@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "編集しました"], ["updated_at", "2020-03-10 01:09:32.324536"], ["id", 3]]
---
  def update
  	@book = Book.find(params[:id])
  	if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]
---
  def destroy
  	@book = Book.find(params[:id])
  	@book.destroy